# # Ваша програма має перенести останній елемент списку з кінця на початок, тобто, останній елемент списку має стати першим. Послідовність інших елементів не має змінюватися.
# # Порожній список або список з одним елементом повинен залишитися незмінним.
# # Кількість елементів у списку може бути будь-яким – нуль та більше!
# # Copy code
# # Приклади:
# # [12, 3, 4, 10] => [10, 12, 3, 4]
# # [1] => [1]
# # [] => []
# # [12, 3, 4, 10, 8] => [8, 12, 3, 4, 10]

user_list = [12, 3, 4, 10]
print(f"{user_list[3:] + user_list[:3]}")

user_list = [1] # Или оставляем пустое значение и получаем решение
if len(user_list) > 1:
    user_list = [user_list[-1]] + user_list[:-1]
print(user_list)

new_list = [12, 3, 4, 10, 8]
new_list_user = [new_list[4]] + new_list[0:4]
print(new_list_user)
