# # Ваша програма має перенести останній елемент списку з кінця на початок, тобто, останній елемент списку має стати першим. Послідовність інших елементів не має змінюватися.
# # Порожній список або список з одним елементом повинен залишитися незмінним.
# # Кількість елементів у списку може бути будь-яким – нуль та більше!
# # Copy code
# # Приклади:
# # [12, 3, 4, 10] => [10, 12, 3, 4]
# # [1] => [1]
# # [] => []
# # [12, 3, 4, 10, 8] => [8, 12, 3, 4, 10]


user_list = [12, 3, 4, 10]  # Можна змінювати для перевірки

if len(user_list) > 1:
    user_list = [user_list[-1]] + user_list[:-1]

print(user_list)

